{"status":"ok","totalResults":10,"articles":[{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Catherine Shu","title":"Singapore-based Tinvio raises $12M Series A to build financial services for supply chain merchants","description":"First created to give supply chain merchants a streamlined way to communicate with buyers, Tinvio is now preparing to launch financial services, including financing and credit card issuing. The Singapore-based startup announced today it has raised a $12 milli…","url":"https://techcrunch.com/2021/07/14/singapore-based-tinvio-raises-12m-series-a-to-build-financial-services-for-supply-chain-merchants/","urlToImage":"https://techcrunch.com/wp-content/uploads/2021/07/Core-app-mockups_white-bg.png?w=711","publishedAt":"2021-07-15T06:36:19Z","content":"First created to give supply chain merchants a streamlined way to communicate with buyers, Tinvio is now preparing to launch financial services, including financing and credit card issuing. The Singa… [+3438 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Catherine Shu","title":"Easy Eat AI raises $5M to help Southeast Asian restaurants digitize their operations","description":"Easy Eat AI, a Singapore-based startup that wants to “transform restaurants into technology companies,” announced today it has raised $5 million in funding. Easy Eat AI offers an operating system for restaurants that lets them digitize all parts of their busi…","url":"https://techcrunch.com/2021/07/14/easy-eat-ai-raises-5m-to-help-southeast-asian-restaurants-digitize-their-operations/","urlToImage":"https://techcrunch.com/wp-content/uploads/2021/07/GettyImages-1271227743.jpg?w=655","publishedAt":"2021-07-15T05:12:53Z","content":"Easy Eat AI, a Singapore-based startup that wants to transform restaurants into technology companies, announced today it has raised $5 million in funding. Easy Eat AI offers an operating system for r… [+3790 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Catherine Shu","title":"YC-backed Deskimo, an on-demand coworking space app, launches in Singapore and Hong Kong","description":"Part of Y Combinator’s current batch, Deskimo wants to make finding coworking spaces easier. Its on-demand booking app is currently available in Singapore and Hong Kong, with plans to enter more markets after Demo Day. Its founders are former Rocket Internet …","url":"https://techcrunch.com/2021/07/14/yc-backed-deskimo-an-on-demand-coworking-space-app-launches-in-singapore-and-hong-kong/","urlToImage":"https://techcrunch.com/wp-content/uploads/2021/07/2-Arcc-Spaces.jpeg?w=533","publishedAt":"2021-07-15T03:00:09Z","content":"Arcc, a coworking space in Singapore available for bookings on Deskimo\r\nPart of Y Combinators current batch, Deskimo wants to make finding coworking spaces easier. Its on-demand booking app is curren… [+4028 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Aria Alamalhodaei","title":"NHTSA urges some Chevy Bolt owners to park their car away from home, citing fire risk","description":"Chevrolet Bolts are back in the news — this time for another consumer alert issued by the National Highway Traffic and Safety Administration, less than a year after the agency issued a recall for a similar issue. NHTSA is recommending owners of Model Year 201…","url":"https://techcrunch.com/2021/07/14/nhtsa-urges-some-chevy-bolt-owners-to-park-their-car-away-from-home-citing-fire-risk/","urlToImage":"https://techcrunch.com/wp-content/uploads/2019/08/2020-Chevrolet-BoltEV-001.jpg?w=600","publishedAt":"2021-07-14T22:32:04Z","content":"Chevrolet Bolts are back in the news — this time for another consumer alert issued by the National Highway Traffic and Safety Administration, less than a year after the agency issued a recall for a s… [+1211 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Alex Wilhelm","title":"Daily Crunch: Citing data storage violations, India blocks Mastercard from onboarding new customers","description":"Hello friends and welcome to Daily Crunch, bringing you the most important startup, tech and venture capital news in a single package.","url":"https://techcrunch.com/2021/07/14/daily-crunch-31/","urlToImage":"https://techcrunch.com/wp-content/uploads/2019/12/GettyImages-1159840867.jpg?w=600","publishedAt":"2021-07-14T22:10:18Z","content":"To get a roundup of TechCrunchs biggest and most important stories delivered to your inbox every day at 3 p.m. PDT, subscribe here.\r\nHello and welcome to Daily Crunch for July 14, 2021. We have a jam… [+7468 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Danny Crichton","title":"Khosla's Adina Tecklu breaks down how to nail your pitch","description":"It's so critical to frame the problem from your perspective. And I also think that this is a really great opportunity to introduce emotion to really build a more compelling story.","url":"https://techcrunch.com/2021/07/14/khoslas-adina-tecklu-breaks-down-how-to-nail-your-pitch/","urlToImage":"https://techcrunch.com/wp-content/uploads/2021/03/Adina-Tecklu.jpg?w=400","publishedAt":"2021-07-14T21:45:54Z","content":"Pitching is perhaps the single most important skill that any founder needs to hone, so not surprisingly, we kicked off our TechCrunch Early Stage 2021 Marketing &amp; Fundraising event with a deep di… [+2274 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Taylor Hatmaker","title":"Clubhouse ventures beyond audio with Backchannel, a new messaging feature","description":"We knew DMs were on the way to Clubhouse and today the new feature landed, spicing up the audio-only app with a text-based chat feature. Clubhouse’s new direct messaging system, called “Backchannel,” gives users an oft-requested way to start conversations beh…","url":"https://techcrunch.com/2021/07/14/clubhouse-dms-backchannel/","urlToImage":"https://techcrunch.com/wp-content/uploads/2021/03/AP21074326915175.jpg?w=600","publishedAt":"2021-07-14T21:27:44Z","content":"We knew DMs were on the way to Clubhouse and today the new feature landed, spicing up the audio-only app with a text-based chat feature. Clubhouse’s new direct messaging system, called “Backchannel,”… [+1586 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Ron Miller","title":"Could Cloud PCs be Microsoft's gateway to Chromebook-like hardware?","description":"When Microsoft announced that it was releasing a cloud PC service called Windows 365 this morning, it got me thinking. While Windows 365 is about packaging a virtual Windows business desktop in a cloud context, if you think about the announcement in a differe…","url":"https://techcrunch.com/2021/07/14/could-cloud-pcs-be-microsofts-gateway-to-chromebook-like-hardware/","urlToImage":"https://techcrunch.com/wp-content/uploads/2021/07/Screen-Shot-2021-07-14-at-3.34.53-PM.jpg?w=575","publishedAt":"2021-07-14T21:18:04Z","content":"When Microsoft announced that it was releasing a cloud PC service called Windows 365 this morning, it got me thinking. While Windows 365 is about packaging a virtual Windows business desktop in a clo… [+4592 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Rebecca Bellan","title":"Semiconductor wafer producer SK Siltron to invest $300M in US to boost EV supply chain","description":"The United States has fallen behind China and Europe in the production and adoption of electric vehicles, especially from 2017 to 2020, according to a study by the International Council on Clean Transportation. One important piece of the puzzle that the U.S. …","url":"https://techcrunch.com/2021/07/14/semiconductor-wafer-producer-sk-siltron-to-invest-300m-in-us-to-boost-ev-supply-chain/","urlToImage":"https://techcrunch.com/wp-content/uploads/2021/07/Screen-Shot-2021-07-15-at-8.37.44-am.png?w=659","publishedAt":"2021-07-14T21:17:05Z","content":"The United States has fallen behind China and Europe in the production and adoption of electric vehicles, especially from 2017 to 2020, according to a study by the International Council on Clean Tran… [+3816 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Kirsten Korosec","title":"Toyota's Woven Planet acquires HD mapping startup Carmera","description":"Woven Planet Holdings — an entity created by Toyota to invest in, develop and eventually bring future of transportation technologies like automated driving to market — has acquired HD mapping startup Carmera for an undisclosed amount. The announcement comes l…","url":"https://techcrunch.com/2021/07/14/toyotas-woven-planet-acquires-hd-mapping-startup-carmera/","urlToImage":"https://techcrunch.com/wp-content/uploads/2021/07/★Cobra_Detroit_PoC_Still-2.png?w=712","publishedAt":"2021-07-14T21:00:29Z","content":"Woven Planet Holdings an entity created by Toyota to invest in, develop and eventually bring future of transportation technologies like automated driving to market has acquired HD mapping startup Car… [+5681 chars]"}]}